## Greenhouse emission data preparation

In [20]:
# Import libraries
import pandas as pd 
import project_libs as libs
import seaborn as sns

In [21]:
#Load Emission data
total_green_house_emission = libs.read_csv_to_dataframe('data/total-ghg-emissions.csv')
total_green_house_emission.rename(columns={'Entity':'Country'}, inplace=True)

shape (37195, 4)
----------------------------------------------------------------------------------------------------
List of columns
['Entity', 'Code', 'Year', 'Annual greenhouse gas emissions in CO₂ equivalents']
----------------------------------------------------------------------------------------------------
Data info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37195 entries, 0 to 37194
Data columns (total 4 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Entity                                              37195 non-null  object
 1   Code                                                34081 non-null  object
 2   Year                                                37195 non-null  int64
 3   Annual greenhouse gas emissions in CO₂ equivalents  37195 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 1.1+ MB
None
----------------------------------------------------------------------------------------------------

In [22]:
#Load cap data
counties_with_cap = libs.read_csv_to_dataframe('data/countries with cap and trade.csv')

shape (42, 3)
----------------------------------------------------------------------------------------------------
List of columns
['Country', 'Year', 'Cap_and_trade']
----------------------------------------------------------------------------------------------------
Data info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        42 non-null     object
 1   Year           42 non-null     int64
 2   Cap_and_trade  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB
None
----------------------------------------------------------------------------------------------------

In [23]:
display(total_green_house_emission.head())
print('-'* 100)
display(counties_with_cap.head())

       Country Code  Year  Annual greenhouse gas emissions in CO₂ equivalents
0  Afghanistan  AFG  1850                                          7338819.0
1  Afghanistan  AFG  1851                                          7403982.5
2  Afghanistan  AFG  1852                                          7464157.0
3  Afghanistan  AFG  1853                                          7522431.5
4  Afghanistan  AFG  1854                                          7579209.5

----------------------------------------------------------------------------------------------------

    Country  Year  Cap_and_trade
0   Austria  2005              1
1   Belgium  2005              1
2  Bulgaria  2005              1
3   Croatia  2005              1
4    Cyprus  2005              1

In [24]:
# Join Emission and Carbon cap data to get cap label
emission_cap_data = pd.merge(total_green_house_emission, counties_with_cap, on=['Country', 'Year'], how='left')
#Set cap and trade na values to zero (countries with no cap)
emission_cap_data['Cap_and_trade'].fillna(0,inplace=True)

#Check countries that will not join
list1, list2 = counties_with_cap['Country'].unique().tolist(), total_green_house_emission['Country'].unique().tolist()

# Check if the lists are not identical
print([item for item in list1 if item not in list2])

['Czech Republic']

C:\Users\hafto\AppData\Local\Temp\ipykernel_19684\1345894768.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  emission_cap_data['Cap_and_trade'].fillna(0,inplace=True)

In [25]:
#view cap counts
emission_cap_data.head()

,Country,Code,Year,Annual greenhouse gas emissions in CO₂ equivalents,Cap_and_trade
0,Afghanistan,AFG,1850,7338819.0,0.0
1,Afghanistan,AFG,1851,7403982.5,0.0
2,Afghanistan,AFG,1852,7464157.0,0.0
3,Afghanistan,AFG,1853,7522431.5,0.0
4,Afghanistan,AFG,1854,7579209.5,0.0

## Load and clean emission target data by country and year

In [26]:
#laod target data
target = libs.read_csv_to_dataframe('data/target.csv')

shape (22764, 73)
----------------------------------------------------------------------------------------------------
List of columns
['Country', 'ISO2', 'ISO3', 'Indicator', 'Unit', 'Source', 'CTS Code', 'CTS Name', 'CTS Full Descriptor', 'Industry', 'Gas Type', 'Scale', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022', '2023', '2024', '2025', '2026', '2027', '2028', '2029', '2030']
----------------------------------------------------------------------------------------------------
Data info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22764 entries, 0 to 22763
Data columns (total 73 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              22764 non-null  object
 1   ISO2                 19687 non-null  object
 2   ISO3                 22764 non-null  object
 3   Indicator            22764 non-null  object
 4   Unit                 22764 non-null  object
 5   Source               22764 non-null  object
 6   CTS Code             22764 non-null  object
 7   CTS Name             22764 non-null  object
 8   CTS Full Descriptor  22764 non-null  object
 9   Industry             22764 non-null  object
 10  Gas Type             22764 non-null  object
 11  Scale                22764 non-null  object
 12  1970                 16061 non-null  float64
 13  1971                 16072 non-null  float64
 14  1972                 16066 non-null  float64
 15  1973                 16092 non-null  float64
 16  1974                 16198 non-null  float64
 17  1975                 16227 non-null  float64
 18  1976                 16263 non-null  float64
 19  1977                 16172 non-null  float64
 20  1978                 16394 non-null  float64
 21  1979                 16398 non-null  float64
 22  1980                 16640 non-null  float64
 23  1981                 16707 non-null  float64
 24  1982                 16726 non-null  float64
 25  1983                 16753 non-null  float64
 26  1984                 16756 non-null  float64
 27  1985                 16778 non-null  float64
 28  1986                 16768 non-null  float64
 29  1987                 16767 non-null  float64
 30  1988                 16757 non-null  float64
 31  1989                 16758 non-null  float64
 32  1990                 18252 non-null  float64
 33  1991                 18261 non-null  float64
 34  1992                 18354 non-null  float64
 35  1993                 18421 non-null  float64
 36  1994                 18459 non-null  float64
 37  1995                 18516 non-null  float64
 38  1996                 18531 non-null  float64
 39  1997                 18553 non-null  float64
 40  1998                 18575 non-null  float64
 41  1999                 18494 non-null  float64
 42  2000                 18471 non-null  float64
 43  2001                 18397 non-null  float64
 44  2002                 18488 non-null  float64
 45  2003                 18531 non-null  float64
 46  2004                 18738 non-null  float64
 47  2005                 18815 non-null  float64
 48  2006                 18802 non-null  float64
 49  2007                 18740 non-null  float64
 50  2008                 18754 non-null  float64
 51  2009                 18766 non-null  float64
 52  2010                 18828 non-null  float64
 53  2011                 18806 non-null  float64
 54  2012                 18836 non-null  float64
 55  2013                 18837 non-null  float64
 56  2014                 18860 non-null  float64
 57  2015                 18866 non-null  float64
 58  2016                 18865 non-null  float64
 59  2017                 18933 non-null  float64
 60  2018                 18910 non-null  float64
 61  2019                 18915 non-null  float64
 62  2020                 18912 non-null  float64
 63  2021                 18877 non-null  float64
 64  2022                 19472 non-null  float64
 65  2023                 597 non-null    float64
 66  2024                 597 non-null    float64
 67  2025                 597 non-null    float64
 68  2026                 597 non-null    float64
 69  2027                 597 non-null    float64
 70  2028                 597 non-null    float64
 71  2029                 597 non-null    float64
 72  2030                 2388 non-null   float64
dtypes: float64(61), object(12)
memory usage: 12.7+ MB
None
----------------------------------------------------------------------------------------------------

In [27]:
#Melt and aggrigate target emission values
target_column_list = target.select_dtypes(include = 'number').columns.to_list()
target_column_list.append('Country')

target_emission_data = target[target_column_list]
target_emission  = target_emission_data.melt(id_vars=['Country'], var_name='Year', value_name='emission_target').groupby(['Country', 'Year']).agg({'emission_target': 'sum'}).reset_index()
target_emission ['Year']= target_emission['Year'].astype('int64')
#Display head
target_emission.head()

              Country  Year  emission_target
0  Advanced Economies  1970    117279.931241
1  Advanced Economies  1971    116247.111022
2  Advanced Economies  1972    120931.530411
3  Advanced Economies  1973    126689.687342
4  Advanced Economies  1974    123634.675667

In [28]:
#Combine emission and target data by country and year
emission_cap_target_data = pd.merge(emission_cap_data, target_emission, on=['Country', 'Year'], how='left')

#display tail
emission_cap_target_data.tail()

,Country,Code,Year,Annual greenhouse gas emissions in CO₂ equivalents,Cap_and_trade,emission_target
37198,Zimbabwe,ZWE,2018,37847984.0,0.0,602.030661
37199,Zimbabwe,ZWE,2019,36351330.0,0.0,590.823283
37200,Zimbabwe,ZWE,2020,33081062.0,0.0,570.481972
37201,Zimbabwe,ZWE,2021,33889200.0,0.0,580.824175
37202,Zimbabwe,ZWE,2022,34333068.0,0.0,744.094865

## Read surface temprature by year and country

In [29]:
#laod targetco2 concentration data
surface_temp = libs.read_csv_to_dataframe('data/23_Annual_Surface_Temperature_Change.csv')

shape (225, 71)
----------------------------------------------------------------------------------------------------
List of columns
['Country', 'ISO2', 'ISO3', 'Indicator', 'Unit', 'Source', 'CTS Code', 'CTS Name', 'CTS Full Descriptor', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022']
----------------------------------------------------------------------------------------------------
Data info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 71 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              225 non-null    object
 1   ISO2                 223 non-null    object
 2   ISO3                 225 non-null    object
 3   Indicator            225 non-null    object
 4   Unit                 225 non-null    object
 5   Source               225 non-null    object
 6   CTS Code             225 non-null    object
 7   CTS Name             225 non-null    object
 8   CTS Full Descriptor  225 non-null    object
 9   1961                 188 non-null    float64
 10  1962                 189 non-null    float64
 11  1963                 188 non-null    float64
 12  1964                 188 non-null    float64
 13  1965                 188 non-null    float64
 14  1966                 192 non-null    float64
 15  1967                 191 non-null    float64
 16  1968                 191 non-null    float64
 17  1969                 190 non-null    float64
 18  1970                 189 non-null    float64
 19  1971                 191 non-null    float64
 20  1972                 192 non-null    float64
 21  1973                 193 non-null    float64
 22  1974                 192 non-null    float64
 23  1975                 188 non-null    float64
 24  1976                 189 non-null    float64
 25  1977                 185 non-null    float64
 26  1978                 189 non-null    float64
 27  1979                 189 non-null    float64
 28  1980                 191 non-null    float64
 29  1981                 191 non-null    float64
 30  1982                 192 non-null    float64
 31  1983                 190 non-null    float64
 32  1984                 188 non-null    float64
 33  1985                 188 non-null    float64
 34  1986                 190 non-null    float64
 35  1987                 190 non-null    float64
 36  1988                 190 non-null    float64
 37  1989                 190 non-null    float64
 38  1990                 189 non-null    float64
 39  1991                 188 non-null    float64
 40  1992                 208 non-null    float64
 41  1993                 209 non-null    float64
 42  1994                 208 non-null    float64
 43  1995                 210 non-null    float64
 44  1996                 210 non-null    float64
 45  1997                 207 non-null    float64
 46  1998                 210 non-null    float64
 47  1999                 209 non-null    float64
 48  2000                 209 non-null    float64
 49  2001                 208 non-null    float64
 50  2002                 212 non-null    float64
 51  2003                 214 non-null    float64
 52  2004                 213 non-null    float64
 53  2005                 212 non-null    float64
 54  2006                 215 non-null    float64
 55  2007                 217 non-null    float64
 56  2008                 212 non-null    float64
 57  2009                 212 non-null    float64
 58  2010                 215 non-null    float64
 59  2011                 217 non-null    float64
 60  2012                 215 non-null    float64
 61  2013                 216 non-null    float64
 62  2014                 216 non-null    float64
 63  2015                 216 non-null    float64
 64  2016                 213 non-null    float64
 65  2017                 214 non-null    float64
 66  2018                 213 non-null    float64
 67  2019                 213 non-null    float64
 68  2020                 212 non-null    float64
 69  2021                 213 non-null    float64
 70  2022                 213 non-null    float64
dtypes: float64(62), object(9)
memory usage: 124.9+ KB
None
----------------------------------------------------------------------------------------------------

In [30]:
#display head
surface_temp.head()

,Country,ISO2,ISO3,Indicator,Unit,Source,CTS Code,CTS Name,CTS Full Descriptor,1961,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,"Afghanistan, Islamic Rep. of",AF,AFG,Temperature change with respect to a baseline ...,Degree Celsius,Food and Agriculture Organization of the Unite...,ECCS,Surface Temperature Change,"Environment, Climate Change, Climate Indicator...",-0.113,...,1.281,0.456,1.093,1.555,1.540,1.544,0.910,0.498,1.327,2.012
1,Albania,AL,ALB,Temperature change with respect to a baseline ...,Degree Celsius,Food and Agriculture Organization of the Unite...,ECCS,Surface Temperature Change,"Environment, Climate Change, Climate Indicator...",0.627,...,1.333,1.198,1.569,1.464,1.121,2.028,1.675,1.498,1.536,1.518
2,Algeria,DZ,DZA,Temperature change with respect to a baseline ...,Degree Celsius,Food and Agriculture Organization of the Unite...,ECCS,Surface Temperature Change,"Environment, Climate Change, Climate Indicator...",0.164,...,1.192,1.690,1.121,1.757,1.512,1.210,1.115,1.926,2.330,1.688
3,American Samoa,AS,ASM,Temperature change with respect to a baseline ...,Degree Celsius,Food and Agriculture Organization of the Unite...,ECCS,Surface Temperature Change,"Environment, Climate Change, Climate Indicator...",0.079,...,1.257,1.170,1.009,1.539,1.435,1.189,1.539,1.430,1.268,1.256
4,"Andorra, Principality of",AD,AND,Temperature change with respect to a baseline ...,Degree Celsius,Food and Agriculture Organization of the Unite...,ECCS,Surface Temperature Change,"Environment, Climate Change, Climate Indicator...",0.736,...,0.831,1.946,1.690,1.990,1.925,1.919,1.964,2.562,1.533,3.243

In [31]:
#Melt and aggrigate temprature data
col_list = surface_temp.select_dtypes(include = 'number').columns.tolist()
col_list.append('Country')

yearly_surface_tem_change = surface_temp[col_list]

yearly_surface_tem_change = yearly_surface_tem_change.melt(id_vars=['Country'], var_name='Year', value_name='temp_change').groupby(['Country', 'Year']).agg({'temp_change': 'mean'}).reset_index()

#display head
yearly_surface_tem_change.head()

                        Country  Year  temp_change
0  Afghanistan, Islamic Rep. of  1961       -0.113
1  Afghanistan, Islamic Rep. of  1962       -0.164
2  Afghanistan, Islamic Rep. of  1963        0.847
3  Afghanistan, Islamic Rep. of  1964       -0.764
4  Afghanistan, Islamic Rep. of  1965       -0.244

In [32]:
#Combine temprature change data with emission data
yearly_surface_tem_change ['Year']= target_emission['Year'].astype('int64')

emission_cap_target_data_temp = pd.merge(emission_cap_target_data, yearly_surface_tem_change, on=['Country', 'Year'], how='left')

emission_cap_target_data_temp.tail()

,Country,Code,Year,Annual greenhouse gas emissions in CO₂ equivalents,Cap_and_trade,emission_target,temp_change
37315,Zimbabwe,ZWE,2018,37847984.0,0.0,602.030661,0.093
37316,Zimbabwe,ZWE,2019,36351330.0,0.0,590.823283,0.215
37317,Zimbabwe,ZWE,2020,33081062.0,0.0,570.481972,0.421
37318,Zimbabwe,ZWE,2021,33889200.0,0.0,580.824175,-0.052
37319,Zimbabwe,ZWE,2022,34333068.0,0.0,744.094865,-0.397

## Load and clean renewable energy data by year and country

In [33]:
#laod targetco2 concentration data
renewable_energy = libs.read_csv_to_dataframe('data/10_Renewable_Energy.csv')

renewable_list = renewable_energy.select_dtypes(include = 'number').columns.tolist()
renewable_list.append('Country')

shape (2617, 34)
----------------------------------------------------------------------------------------------------
List of columns
['Country', 'ISO2', 'ISO3', 'Indicator', 'Technology', 'Energy Type', 'Unit', 'Source', 'CTS Name', 'CTS Code', 'CTS Full Descriptor', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022']
----------------------------------------------------------------------------------------------------
Data info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2617 entries, 0 to 2616
Data columns (total 34 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              2617 non-null   object
 1   ISO2                 2139 non-null   object
 2   ISO3                 2617 non-null   object
 3   Indicator            2617 non-null   object
 4   Technology           2617 non-null   object
 5   Energy Type          2617 non-null   object
 6   Unit                 2617 non-null   object
 7   Source               0 non-null      float64
 8   CTS Name             2617 non-null   object
 9   CTS Code             2617 non-null   object
 10  CTS Full Descriptor  2617 non-null   object
 11  2000                 1837 non-null   float64
 12  2001                 1894 non-null   float64
 13  2002                 1924 non-null   float64
 14  2003                 1940 non-null   float64
 15  2004                 1957 non-null   float64
 16  2005                 2006 non-null   float64
 17  2006                 2026 non-null   float64
 18  2007                 2080 non-null   float64
 19  2008                 2113 non-null   float64
 20  2009                 2176 non-null   float64
 21  2010                 2234 non-null   float64
 22  2011                 2291 non-null   float64
 23  2012                 2351 non-null   float64
 24  2013                 2417 non-null   float64
 25  2014                 2448 non-null   float64
 26  2015                 2480 non-null   float64
 27  2016                 2505 non-null   float64
 28  2017                 2530 non-null   float64
 29  2018                 2539 non-null   float64
 30  2019                 2546 non-null   float64
 31  2020                 2566 non-null   float64
 32  2021                 2573 non-null   float64
 33  2022                 1295 non-null   float64
dtypes: float64(24), object(10)
memory usage: 695.3+ KB
None
----------------------------------------------------------------------------------------------------

In [34]:
#Filter renewable energy data to only country and year and value
renewable_list.remove('Source')

#select only required columns
renewable_energy_data  = renewable_energy[renewable_list]

#Melt and aggrigate
renewable_energy_data = renewable_energy_data.melt(id_vars=['Country'], var_name='Year', value_name='renewable_energy').groupby(['Country', 'Year']).agg({'renewable_energy': 'mean'}).reset_index()

#Display head
renewable_energy_data.head()

              Country  Year  renewable_energy
0  Advanced Economies  2000      564735.72180
1  Advanced Economies  2001      558368.03965
2  Advanced Economies  2002      576313.75415
3  Advanced Economies  2003      582884.29605
4  Advanced Economies  2004      596069.97165

In [35]:
#Combine renewable energy data to master data
renewable_energy_data ['Year']= renewable_energy_data['Year'].astype('int64')

master_emission_data = pd.merge(emission_cap_target_data_temp, renewable_energy_data, on=['Country', 'Year'], how='left')

#Remove Code
master_emission_data.drop(columns='Code',inplace=True,axis=1)

#display tail

master_emission_data.tail()

,Country,Year,Annual greenhouse gas emissions in CO₂ equivalents,Cap_and_trade,emission_target,temp_change,renewable_energy
37315,Zimbabwe,2018,37847984.0,0.0,602.030661,0.093,1494.560625
37316,Zimbabwe,2019,36351330.0,0.0,590.823283,0.215,1478.418750
37317,Zimbabwe,2020,33081062.0,0.0,570.481972,0.421,1116.044500
37318,Zimbabwe,2021,33889200.0,0.0,580.824175,-0.052,1391.685875
37319,Zimbabwe,2022,34333068.0,0.0,744.094865,-0.397,618.003500

In [36]:
from sklearn.impute import SimpleImputer
import pandas as pd

# Assuming df is your DataFrame with missing values
# Create an instance of SimpleImputer
imputer = SimpleImputer(strategy='most_frequent')  # Other strategies: median, most_frequent, constant

# Fit and transform the data
master_data = pd.DataFrame(imputer.fit_transform(master_emission_data), columns=master_emission_data.columns)

In [37]:
master_data.to_csv('data/master_emission_data.csv', index= False)

In [40]:
master_data.isna().sum()

Country                                               0
Year                                                  0
Annual greenhouse gas emissions in CO₂ equivalents    0
Cap_and_trade                                         0
emission_target                                       0
temp_change                                           0
renewable_energy                                      0
dtype: int64